test/load/participant-scenario-run.yml
config:
  target: 'https://teacher-moments.herokuapp.com'
  payload:
      # path is relative to the location of the test script
      -
        path: "./payload/test-users.csv"
        fields:
          - "username"
          - "password"
      -
        path: "./payload/scenario-urls.csv"
        fields:
          - "scenarioUrl"
          - "scenarioId"
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 120
      arrivalRate: 1
      rampTo: 3
    - duration: 600
      arrivalRate: 1
scenarios:
  - name: "Get scenarios on the front end"
    flow:
    - get:
        url: "{{ scenarioUrl }}"
  - name: "Create participants and then their run"
    flow:
    - post:
        url: "/api/auth/signup"
        json:
          username: "{{ username }}"
          password: "{{ password }}"
    - put:
        url: "/api/runs/new-or-existing/scenario/{{ scenarioId }}"